espressif/esp-idf/components/soc/esp32s31/register/soc/lp_ahb_dma_struct.h
/** Type of out_dscr_chn register
 *  Current transmit descriptor address of TX channel n
 */
typedef union {
    struct {
        /** outlink_dscr_chn : RO; bitpos: [31:0]; default: 0;
         *  Represents the address of the next transmit descriptor y+1 pointed by the current
         *  transmit descriptor that has already been fetched.
         */
        uint32_t outlink_dscr_chn:32;
    };
    uint32_t val;
} ahb_dma_out_dscr_chn_reg_t;

/** Type of out_dscr_bf0_chn register
 *  The last transmit descriptor address of TX channel n
 */
typedef union {
    struct {
        /** outlink_dscr_bf0_chn : RO; bitpos: [31:0]; default: 0;
         *  Represents the address of the current transmit descriptor y that has already been
         *  fetched.
         */
        uint32_t outlink_dscr_bf0_chn:32;
    };
    uint32_t val;
} ahb_dma_out_dscr_bf0_chn_reg_t;

/** Type of out_dscr_bf1_chn register
 *  The second-to-last transmit descriptor address of TX channel n
 */
typedef union {
    struct {
        /** outlink_dscr_bf1_chn : RO; bitpos: [31:0]; default: 0;
         *  Represents the address of the previous transmit descriptor y-1 that has already
         *  been fetched.
         */
        uint32_t outlink_dscr_bf1_chn:32;
    };
    uint32_t val;
} ahb_dma_out_dscr_bf1_chn_reg_t;

/** Type of ahbinf_resp_err_status0 register
 *  AHB response error status 0 register
 */
typedef union {
    struct {
        /** ahbinf_resp_err_addr : RO; bitpos: [31:0]; default: 0;
         *  Represents the address of the AHB response error.
         */
        uint32_t ahbinf_resp_err_addr:32;
    };
    uint32_t val;
} ahb_dma_ahbinf_resp_err_status0_reg_t;

/** Type of ahbinf_resp_err_status1 register
 *  AHB response error status 1 register
 */
typedef union {
    struct {
        /** ahbinf_resp_err_wr : RO; bitpos: [0]; default: 0;
         *  Represents the AHB response error is write request.
         */
        uint32_t ahbinf_resp_err_wr:1;
        /** ahbinf_resp_err_id : RO; bitpos: [5:1]; default: 31;
         *  Represents the AHB response error request id.
         */
        uint32_t ahbinf_resp_err_id:5;
        /** ahbinf_resp_err_ch_id : RO; bitpos: [7:6]; default: 0;
         *  Represents the AHB response error request channel id.bit[1]=1:TX channel.
         *  bit[1]=0:RX channel.
         */
        uint32_t ahbinf_resp_err_ch_id:2;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} ahb_dma_ahbinf_resp_err_status1_reg_t;


/** Group: Priority Registers */
/** Type of in_pri_chn register
 *  Priority register of RX channel n
 */
typedef union {
    struct {
        /** rx_pri_chn : R/W; bitpos: [3:0]; default: 0;
         *  Configures the priority of RX channel n.The larger of the value, the higher of the
         *  priority.
         */
        uint32_t rx_pri_chn:4;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} ahb_dma_in_pri_chn_reg_t;

/** Type of out_pri_chn register
 *  Priority register of TX channel n
 */
typedef union {
    struct {
        /** tx_pri_chn : R/W; bitpos: [3:0]; default: 0;
         *  Configures the priority of TX channel n.The larger of the value, the higher of the
         *  priority.
         */
        uint32_t tx_pri_chn:4;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} ahb_dma_out_pri_chn_reg_t;


/** Group: Peripheral Select Registers */
/** Type of in_peri_sel_chn register
 *  Peripheral selection register of RX channel n
 */
typedef union {
    struct {
        /** peri_in_sel_chn : R/W; bitpos: [5:0]; default: 63;
         *  Configures the peripheral connected to RX channel n.
         *  0: ADC
         *  1: DAC
         *  2~15: DUMMY
         */
        uint32_t peri_in_sel_chn:6;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} ahb_dma_in_peri_sel_chn_reg_t;

/** Type of out_peri_sel_chn register
 *  Peripheral selection register of TX channel n
 */
typedef union {
    struct {
        /** peri_out_sel_chn : R/W; bitpos: [5:0]; default: 63;
         *  Configures the peripheral connected to TX channel n.
         *  0: ADC
         *  1: DAC
         *  2~15: DUMMY
         */
        uint32_t peri_out_sel_chn:6;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} ahb_dma_out_peri_sel_chn_reg_t;


typedef struct {
    volatile ahb_dma_in_int_raw_chn_reg_t in_int_raw_ch0;
    volatile ahb_dma_in_int_st_chn_reg_t in_int_st_ch0;
    volatile ahb_dma_in_int_ena_chn_reg_t in_int_ena_ch0;
    volatile ahb_dma_in_int_clr_chn_reg_t in_int_clr_ch0;
    volatile ahb_dma_in_int_raw_chn_reg_t in_int_raw_ch1;
    volatile ahb_dma_in_int_st_chn_reg_t in_int_st_ch1;
    volatile ahb_dma_in_int_ena_chn_reg_t in_int_ena_ch1;
    volatile ahb_dma_in_int_clr_chn_reg_t in_int_clr_ch1;
    uint32_t reserved_020[12];
    volatile ahb_dma_out_int_raw_chn_reg_t out_int_raw_ch0;
    volatile ahb_dma_out_int_st_chn_reg_t out_int_st_ch0;
    volatile ahb_dma_out_int_ena_chn_reg_t out_int_ena_ch0;
    volatile ahb_dma_out_int_clr_chn_reg_t out_int_clr_ch0;
    volatile ahb_dma_out_int_raw_chn_reg_t out_int_raw_ch1;
    volatile ahb_dma_out_int_st_chn_reg_t out_int_st_ch1;
    volatile ahb_dma_out_int_ena_chn_reg_t out_int_ena_ch1;
    volatile ahb_dma_out_int_clr_chn_reg_t out_int_clr_ch1;
    uint32_t reserved_070[12];
    volatile ahb_dma_ahb_test_reg_t ahb_test;
    volatile ahb_dma_misc_conf_reg_t misc_conf;
    volatile ahb_dma_date_reg_t date;
    uint32_t reserved_0ac[21];
    volatile ahb_dma_in_conf0_chn_reg_t in_conf0_ch0;
    volatile ahb_dma_in_conf1_chn_reg_t in_conf1_ch0;
    volatile ahb_dma_infifo_status_chn_reg_t infifo_status_ch0;
    volatile ahb_dma_in_pop_chn_reg_t in_pop_ch0;
    volatile ahb_dma_in_link_chn_reg_t in_link_ch0;
    volatile ahb_dma_in_link_addr_chn_reg_t in_link_addr_ch0;
    volatile ahb_dma_in_state_chn_reg_t in_state_ch0;
    volatile ahb_dma_in_suc_eof_des_addr_chn_reg_t in_suc_eof_des_addr_ch0;
    volatile ahb_dma_in_err_eof_des_addr_chn_reg_t in_err_eof_des_addr_ch0;
    volatile ahb_dma_in_done_des_addr_chn_reg_t in_done_des_addr_ch0;
    volatile ahb_dma_in_dscr_chn_reg_t in_dscr_ch0;
    volatile ahb_dma_in_dscr_bf0_chn_reg_t in_dscr_bf0_ch0;
    volatile ahb_dma_in_dscr_bf1_chn_reg_t in_dscr_bf1_ch0;
    volatile ahb_dma_in_pri_chn_reg_t in_pri_ch0;
    volatile ahb_dma_in_peri_sel_chn_reg_t in_peri_sel_ch0;
    volatile ahb_dma_rx_ch_arb_weigh_chn_reg_t rx_ch_arb_weigh_ch0;
    volatile ahb_dma_rx_arb_weigh_opt_dir_chn_reg_t rx_arb_weigh_opt_dir_ch0;
    uint32_t reserved_144[15];
    volatile ahb_dma_out_conf0_ch0_reg_t out_conf0_ch0;
    volatile ahb_dma_out_conf1_chn_reg_t out_conf1_ch0;
    volatile ahb_dma_outfifo_status_chn_reg_t outfifo_status_ch0;
    volatile ahb_dma_out_push_chn_reg_t out_push_ch0;
    volatile ahb_dma_out_link_chn_reg_t out_link_ch0;
    volatile ahb_dma_out_link_addr_chn_reg_t out_link_addr_ch0;
    volatile ahb_dma_out_state_chn_reg_t out_state_ch0;
    volatile ahb_dma_out_eof_des_addr_chn_reg_t out_eof_des_addr_ch0;
    volatile ahb_dma_out_eof_bfr_des_addr_chn_reg_t out_eof_bfr_des_addr_ch0;
    volatile ahb_dma_out_done_des_addr_chn_reg_t out_done_des_addr_ch0;
    volatile ahb_dma_out_dscr_chn_reg_t out_dscr_ch0;
    volatile ahb_dma_out_dscr_bf0_chn_reg_t out_dscr_bf0_ch0;
    volatile ahb_dma_out_dscr_bf1_chn_reg_t out_dscr_bf1_ch0;
    volatile ahb_dma_out_pri_chn_reg_t out_pri_ch0;
    volatile ahb_dma_out_peri_sel_chn_reg_t out_peri_sel_ch0;
    volatile ahb_dma_tx_ch_arb_weigh_chn_reg_t tx_ch_arb_weigh_ch0;
    volatile ahb_dma_tx_arb_weigh_opt_dir_chn_reg_t tx_arb_weigh_opt_dir_ch0;
    uint32_t reserved_1c4[15];
    volatile ahb_dma_in_conf0_chn_reg_t in_conf0_ch1;
    volatile ahb_dma_in_conf1_chn_reg_t in_conf1_ch1;
    volatile ahb_dma_infifo_status_chn_reg_t infifo_status_ch1;
    volatile ahb_dma_in_pop_chn_reg_t in_pop_ch1;
    volatile ahb_dma_in_link_chn_reg_t in_link_ch1;
    volatile ahb_dma_in_link_addr_chn_reg_t in_link_addr_ch1;
    volatile ahb_dma_in_state_chn_reg_t in_state_ch1;
    volatile ahb_dma_in_suc_eof_des_addr_chn_reg_t in_suc_eof_des_addr_ch1;
    volatile ahb_dma_in_err_eof_des_addr_chn_reg_t in_err_eof_des_addr_ch1;
    volatile ahb_dma_in_done_des_addr_chn_reg_t in_done_des_addr_ch1;
    volatile ahb_dma_in_dscr_chn_reg_t in_dscr_ch1;
    volatile ahb_dma_in_dscr_bf0_chn_reg_t in_dscr_bf0_ch1;
    volatile ahb_dma_in_dscr_bf1_chn_reg_t in_dscr_bf1_ch1;
    volatile ahb_dma_in_pri_chn_reg_t in_pri_ch1;
    volatile ahb_dma_in_peri_sel_chn_reg_t in_peri_sel_ch1;
    volatile ahb_dma_rx_ch_arb_weigh_chn_reg_t rx_ch_arb_weigh_ch1;
    volatile ahb_dma_rx_arb_weigh_opt_dir_chn_reg_t rx_arb_weigh_opt_dir_ch1;
    uint32_t reserved_244[15];
    volatile ahb_dma_out_conf0_chn_reg_t out_conf0_ch1;
    volatile ahb_dma_out_conf1_chn_reg_t out_conf1_ch1;
    volatile ahb_dma_outfifo_status_chn_reg_t outfifo_status_ch1;
    volatile ahb_dma_out_push_chn_reg_t out_push_ch1;
    volatile ahb_dma_out_link_chn_reg_t out_link_ch1;
    volatile ahb_dma_out_link_addr_chn_reg_t out_link_addr_ch1;
    volatile ahb_dma_out_state_chn_reg_t out_state_ch1;
    volatile ahb_dma_out_eof_des_addr_chn_reg_t out_eof_des_addr_ch1;
    volatile ahb_dma_out_eof_bfr_des_addr_chn_reg_t out_eof_bfr_des_addr_ch1;
    volatile ahb_dma_out_done_des_addr_chn_reg_t out_done_des_addr_ch1;
    volatile ahb_dma_out_dscr_chn_reg_t out_dscr_ch1;
    volatile ahb_dma_out_dscr_bf0_chn_reg_t out_dscr_bf0_ch1;
    volatile ahb_dma_out_dscr_bf1_chn_reg_t out_dscr_bf1_ch1;
    volatile ahb_dma_out_pri_chn_reg_t out_pri_ch1;
    volatile ahb_dma_out_peri_sel_chn_reg_t out_peri_sel_ch1;
    volatile ahb_dma_tx_ch_arb_weigh_chn_reg_t tx_ch_arb_weigh_ch1;
    volatile ahb_dma_tx_arb_weigh_opt_dir_chn_reg_t tx_arb_weigh_opt_dir_ch1;
    uint32_t reserved_2c4[207];
    volatile ahb_dma_intr_mem_start_addr_reg_t intr_mem_start_addr;
    volatile ahb_dma_intr_mem_end_addr_reg_t intr_mem_end_addr;
    volatile ahb_dma_arb_timeout_reg_t arb_timeout;
    uint32_t reserved_60c;
    volatile ahb_dma_weight_en_reg_t weight_en;
    uint32_t reserved_614;
    volatile ahb_dma_module_clk_en_reg_t module_clk_en;
    uint32_t reserved_61c;
    volatile ahb_dma_ahbinf_resp_err_status0_reg_t ahbinf_resp_err_status0;
    volatile ahb_dma_ahbinf_resp_err_status1_reg_t ahbinf_resp_err_status1;
} ahb_dma_dev_t;


#ifndef __cplusplus
_Static_assert(sizeof(ahb_dma_dev_t) == 0x628, "Invalid size of ahb_dma_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
